In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('Toyota.csv',index_col=0)
df.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [2]:
#shallow copy
samp_shall = df.copy(deep=False)
samp_shall

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [3]:
#shallow copy
samp_deep = df.copy(deep=True)
samp_deep

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [4]:
samp_deep.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [5]:
samp_deep.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [6]:
df.size

14360

In [7]:
df.shape

(1436, 10)

In [8]:
df.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [9]:
df.ndim

2

In [10]:
#slicing operator []
#dot operator

df.head(10)

   Price   Age     KM FuelType    HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel    90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel    90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel    90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel    90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel    90       0.0          0  2000      3    1170
5  12950  32.0  61000   Diesel    90       0.0          0  2000      3    1170
6  16900  27.0     ??   Diesel  ????       NaN          0  2000      3    1245
7  18600  30.0  75889      NaN    90       1.0          0  2000      3    1245
8  21500  27.0  19700   Petrol   192       0.0          0  1800      3    1185
9  12950  23.0  71138   Diesel  ????       NaN          0  1900      3    1105

In [11]:
#at : it provides label-based lookup
#iat : it provides interger-based lookup

df.at[4,'FuelType']

'Diesel'

In [12]:
df.iat[4,6]

0

In [13]:
df.loc[:,'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [14]:
df.iloc[5]['FuelType']

'Diesel'

In [15]:
#data types

df.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [16]:
#couunt the data types

df.dtypes.value_counts()

int64      4
object     4
float64    2
dtype: int64

In [17]:
df.select_dtypes(include=[],exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

In [19]:
df.isnull().sum()

Price          0
Age          100
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [20]:
np.unique(df['HP'])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

In [21]:
np.unique(df['KM'])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

In [22]:
df['KM'].value_counts()

??       15
1         8
59000     7
36000     7
43000     7
         ..
63635     1
63792     1
64193     1
65170     1
17016     1
Name: KM, Length: 1256, dtype: int64

In [23]:
df['HP'].value_counts(dropna=False)

110     833
86      249
97      164
72       72
90       35
69       33
107      21
192      10
116       9
????      6
98        2
71        1
73        1
Name: HP, dtype: int64

In [24]:
df['MetColor'].unique()

array([ 1., nan,  0.])

In [25]:
df['MetColor'].value_counts(dropna=False)

1.0    868
0.0    418
NaN    150
Name: MetColor, dtype: int64

In [26]:
df['Automatic'].value_counts(dropna=False)

0    1356
1      80
Name: Automatic, dtype: int64

In [27]:
print(df['Doors'].value_counts(dropna=False))

5        673
3        621
4        137
2          2
three      1
four       1
five       1
Name: Doors, dtype: int64

In [28]:
print(np.unique(df['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

In [29]:
df1 = pd.read_csv('Toyota.csv',index_col=0,
                 na_values=['??','????'])

In [30]:
np.unique(df1['HP'])

array([ 69.,  71.,  72.,  73.,  86.,  90.,  97.,  98., 107., 110., 116.,
       192.,  nan])

In [31]:
print(np.unique(df1['KM']))

[1.0000e+00 1.5000e+01 2.2500e+02 ... 2.3294e+05 2.4300e+05        nan]

In [32]:
df1['HP'].value_counts(dropna=False)

110.0    833
86.0     249
97.0     164
72.0      72
90.0      35
69.0      33
107.0     21
192.0     10
116.0      9
NaN        6
98.0       2
71.0       1
73.0       1
Name: HP, dtype: int64

In [33]:
df1['KM'].value_counts(dropna=False)

NaN        15
1.0         8
59000.0     7
36000.0     7
43000.0     7
           ..
63635.0     1
63792.0     1
64193.0     1
65170.0     1
17016.0     1
Name: KM, Length: 1256, dtype: int64

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [36]:
df1['MetColor'].value_counts(dropna=False)

1.0    868
0.0    418
NaN    150
Name: MetColor, dtype: int64

In [37]:
df1['MetColor'] = df1['MetColor'].astype('object')

In [38]:
df1['Automatic'] = df1['Automatic'].astype('object')

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

In [40]:
df1['FuelType'].nbytes

11488

In [41]:
df1['FuelType'].astype('category').nbytes

1460

In [42]:
#replcae

df1['Doors'].replace('three',3,inplace=True)

In [43]:
df1['Doors'].replace('four',4,inplace=True)

In [44]:
df1['Doors'].replace('five',5,inplace=True)

In [45]:
df1['Doors'].value_counts(dropna=False)

5    673
3    621
4    137
2      2
3      1
4      1
5      1
Name: Doors, dtype: int64

In [46]:
df1['Doors'] = df1['Doors'].astype('int64')

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB

In [48]:
np.unique(df1['Doors'])

array([2, 3, 4, 5], dtype=int64)

In [49]:
df1.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [50]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB

In [51]:
df1.insert(10,'Price_class','')

In [52]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Price        1436 non-null   int64
 1   Age          1336 non-null   float64
 2   KM           1421 non-null   float64
 3   FuelType     1336 non-null   object
 4   HP           1430 non-null   float64
 5   MetColor     1286 non-null   object
 6   Automatic    1436 non-null   object
 7   CC           1436 non-null   int64
 8   Doors        1436 non-null   int64
 9   Weight       1436 non-null   int64
 10  Price_class  1436 non-null   object
dtypes: float64(3), int64(4), object(4)
memory usage: 134.6+ KB

In [53]:
df1.drop('Price_class',axis=1,inplace=True)

In [54]:
for i in range(len(df)):
    if df1.at[i,'Price'] <= 8450:
        df1.at[i,'Price_class'] = 'Low'
    elif df1.at[i,'Price'] > 11950:
        df1.at[i,'Price_class'] = 'High'
    else:
        df1.at[i,'Price_class'] = 'Medium'

In [55]:
df1

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High
...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025,Low
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015,Medium
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015,Medium
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015,Low
1435,6950,76.0,1.0,Petrol,110.0,0.0,0,1600,5,1114,Low

In [56]:
df1['Price_class'].value_counts()

Medium    751
Low       369
High      316
Name: Price_class, dtype: int64

In [57]:
df1.insert(11,'Age_converted',0)

In [58]:
df1.insert(12,'KM_per_month',0)

In [59]:
def c_convert(val1,val2):
    val_converted = val1/12
    ratio = val2/val1
    return [val_converted, ratio]

In [60]:
df1['Age_converted'], df1['KM_per_month'] = c_convert(df1['Age'],df1['KM'])

In [61]:
df1.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,Age_converted,KM_per_month
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.916667,2042.869565
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.916667,3171.173913
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.000000,1737.958333
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.166667,1846.153846
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.500000,1283.333333

In [62]:
df1.drop('Age_converted',axis=1,inplace=True)

In [63]:
df1.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,KM_per_month
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,2042.869565
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,3171.173913
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,1737.958333
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,1846.153846
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,1283.333333

In [64]:
df1.sort_values(['FuelType','HP'],ascending=[1,0])

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,KM_per_month
189,7750,43.0,178858.0,CNG,110.0,0.0,0,1600,3,1084,Low,4159.488372
199,11950,NaN,98823.0,CNG,110.0,1.0,0,1600,5,1119,Medium,NaN
209,11950,37.0,82743.0,CNG,110.0,1.0,0,1600,5,1121,Medium,2236.297297
223,14950,44.0,71793.0,CNG,110.0,NaN,0,1600,4,1067,High,1631.659091
296,12950,44.0,41499.0,CNG,110.0,1.0,0,1600,5,1103,High,943.159091
...,...,...,...,...,...,...,...,...,...,...,...,...
696,12250,NaN,96000.0,NaN,72.0,NaN,0,2000,4,1100,High,NaN
1054,8750,78.0,180378.0,NaN,72.0,1.0,0,2000,4,1100,Medium,2312.538462
406,10950,51.0,103018.0,NaN,69.0,0.0,0,1900,5,1140,Medium,2019.960784
412,8950,48.0,98100.0,NaN,69.0,1.0,0,1900,5,1140,Medium,2043.750000
638,10450,64.0,120400.0,NaN,NaN,0.0,0,1600,5,1090,Medium,1881.250000

In [65]:
df1.describe()

,Price,Age,KM,HP,CC,Doors,Weight,KM_per_month
count,1436.000000,1336.000000,1421.000000,1430.000000,1436.000000,1436.000000,1436.00000,1321.000000
mean,10730.824513,55.672156,68647.239972,101.478322,1566.827994,4.033426,1072.45961,1260.217457
std,3626.964585,18.589804,37333.023589,14.768255,187.182436,0.952677,52.64112,638.188748
min,4350.000000,1.000000,1.000000,69.000000,1300.000000,2.000000,1000.00000,0.013158
25%,8450.000000,43.000000,43210.000000,90.000000,1400.000000,3.000000,1040.00000,865.000000
50%,9900.000000,60.000000,63634.000000,110.000000,1600.000000,4.000000,1070.00000,1135.762712
75%,11950.000000,70.000000,87000.000000,110.000000,1600.000000,5.000000,1085.00000,1513.965517
max,32500.000000,80.000000,243000.000000,192.000000,2000.000000,5.000000,1615.00000,5651.162791

In [66]:
#groupby

df1['count'] = 1

In [67]:
df1.groupby(['FuelType','HP']).count()['count']

FuelType  HP
CNG       110.0     15
Diesel    69.0      31
          72.0      69
          73.0       1
          90.0      31
          110.0      2
          116.0      7
Petrol    71.0       1
          86.0     226
          97.0     154
          98.0       2
          107.0     21
          110.0    760
          116.0      1
          192.0     10
Name: count, dtype: int64

In [68]:
#cross tabulation

pd.crosstab(index=df1['FuelType'], columns='count', dropna=True)

col_0     count
FuelType
CNG          15
Diesel      144
Petrol     1177

In [69]:
pd.crosstab(index=df1['Automatic'], columns=df1['FuelType'], dropna=True)

FuelType   CNG  Diesel  Petrol
Automatic
0           15     144    1104
1            0       0      73

In [70]:
#probability

pd.crosstab(index=df1['Automatic'], columns=df1['FuelType'],normalize=True, dropna=True)

FuelType        CNG    Diesel    Petrol
Automatic
0          0.011228  0.107784  0.826347
1          0.000000  0.000000  0.054641

In [71]:
#marginal probabilty

pd.crosstab(index=df1['Automatic'], columns=df1['FuelType'],margins=True, normalize=True, dropna=True)

FuelType        CNG    Diesel    Petrol       All
Automatic
0          0.011228  0.107784  0.826347  0.945359
1          0.000000  0.000000  0.054641  0.054641
All        0.011228  0.107784  0.880988  1.000000

In [72]:
#conditional probabilty

pd.crosstab(index=df1['Automatic'], columns=df1['FuelType'],margins=True, normalize='index', dropna=True)

FuelType        CNG    Diesel    Petrol
Automatic
0          0.011876  0.114014  0.874109
1          0.000000  0.000000  1.000000
All        0.011228  0.107784  0.880988

In [73]:
#conditional probabilty

pd.crosstab(index=df1['Automatic'], columns=df1['FuelType'],margins=True, normalize='columns', dropna=True)

FuelType   CNG  Diesel    Petrol       All
Automatic
0          1.0     1.0  0.937978  0.945359
1          0.0     0.0  0.062022  0.054641

In [74]:
#correlation for numerical varibales

df1[['Price','Weight']].corr()

           Price    Weight
Price   1.000000  0.581198
Weight  0.581198  1.000000

In [75]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Price         1436 non-null   int64
 1   Age           1336 non-null   float64
 2   KM            1421 non-null   float64
 3   FuelType      1336 non-null   object
 4   HP            1430 non-null   float64
 5   MetColor      1286 non-null   object
 6   Automatic     1436 non-null   object
 7   CC            1436 non-null   int64
 8   Doors         1436 non-null   int64
 9   Weight        1436 non-null   int64
 10  Price_class   1436 non-null   object
 11  KM_per_month  1321 non-null   float64
 12  count         1436 non-null   int64
dtypes: float64(4), int64(5), object(4)
memory usage: 189.4+ KB

In [76]:
numercial_data = df1.select_dtypes(exclude=[object])
numercial_data.shape

(1436, 9)

In [77]:
numercial_data.corr()

,Price,Age,KM,HP,CC,Doors,Weight,KM_per_month,count
Price,1.000000,-0.878407,-0.574720,0.309902,0.165067,0.185326,0.581198,-0.038704,NaN
Age,-0.878407,1.000000,0.512735,-0.157904,-0.120706,-0.157027,-0.464299,-0.114745,NaN
KM,-0.574720,0.512735,1.000000,-0.335285,0.299993,-0.036191,-0.026271,0.729894,NaN
HP,0.309902,-0.157904,-0.335285,1.000000,0.053758,0.097162,0.086737,-0.273574,NaN
CC,0.165067,-0.120706,0.299993,0.053758,1.000000,0.126768,0.651450,0.433470,NaN
Doors,0.185326,-0.157027,-0.036191,0.097162,0.126768,1.000000,0.302618,0.041161,NaN
Weight,0.581198,-0.464299,-0.026271,0.086737,0.651450,0.302618,1.000000,0.330868,NaN
KM_per_month,-0.038704,-0.114745,0.729894,-0.273574,0.433470,0.041161,0.330868,1.000000,NaN
count,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [78]:
df1['MetColor'].unique()

array([1.0, nan, 0.0], dtype=object)

In [80]:
df1.isnull().sum()

Price             0
Age             100
KM               15
FuelType        100
HP                6
MetColor        150
Automatic         0
CC                0
Doors             0
Weight            0
Price_class       0
KM_per_month    115
count             0
dtype: int64

In [81]:
#Handling missing values

df1 = df1.apply(lambda x: x.fillna(x.mean())
               if x.dtype=='float'
               else x.fillna(x.value_counts().index[0]))

In [82]:
df1.isnull().sum()

Price           0
Age             0
KM              0
FuelType        0
HP              0
MetColor        0
Automatic       0
CC              0
Doors           0
Weight          0
Price_class     0
KM_per_month    0
count           0
dtype: int64

In [84]:
df1['HP'].value_counts()#.index[0]

110.000000    833
86.000000     249
97.000000     164
72.000000      72
90.000000      35
69.000000      33
107.000000     21
192.000000     10
116.000000      9
101.478322      6
98.000000       2
71.000000       1
73.000000       1
Name: HP, dtype: int64